CommunityGD32Cores/GD32Firmware/GD32W51x/CMSIS/GD/GD32W51x/Include/gd32w51x.h
/* main flash and SRAM memory map */
#define FLASH_BASE_S            ((uint32_t)0x0C000000U)            /*!< main FLASH base address */
#define SRAM0_BASE_S            ((uint32_t)0x30000000U)            /*!< SRAM0 base address */
#define SRAM1_BASE_S            ((uint32_t)0x30010000U)            /*!< SRAM1 bytes base address */
#define SRAM2_BASE_S            ((uint32_t)0x30020000U)            /*!< SRAM2 base address */
#define SRAM3_BASE_S            ((uint32_t)0x30040000U)            /*!< SRAM3 base address */

/* peripheral memory map */
#define APB1_BUS_BASE_S         ((uint32_t)0x50000000U)            /*!< apb1 base address */
#define APB2_BUS_BASE_S         ((uint32_t)0x50010000U)            /*!< apb2 base address */
#define AHB1_BUS_BASE_S         ((uint32_t)0x50020000U)            /*!< ahb1 base address */
#define AHB2_BUS_BASE_S         ((uint32_t)0x5C000000U)            /*!< ahb2 base address */

/* advanced peripheral bus 1 memory map */
#define TIMER_BASE_S            (APB1_BUS_BASE_S + 0x00000000U)    /*!< TIMER base address */
#define RTC_BASE_S              (APB1_BUS_BASE_S + 0x00002800U)    /*!< RTC base address */
#define WWDGT_BASE_S            (APB1_BUS_BASE_S + 0x00002C00U)    /*!< WWDGT base address */
#define FWDGT_BASE_S            (APB1_BUS_BASE_S + 0x00003000U)    /*!< FWDGT base address */
#define I2S_ADD_BASE_S          (APB1_BUS_BASE_S + 0x00003400U)    /*!< I2S base address */
#define SPI_BASE_S              (APB1_BUS_BASE_S + 0x00003800U)    /*!< SPI base address */
#define USART_BASE_S            (APB1_BUS_BASE_S + 0x00004400U)    /*!< USART base address */
#define I2C_BASE_S              (APB1_BUS_BASE_S + 0x00005400U)    /*!< I2C base address */
#define PMU_BASE_S              (APB1_BUS_BASE_S + 0x00007000U)    /*!< PMU base address */

/* advanced peripheral bus 2 memory map */
#define WIFI_RF_BASE_S          (APB2_BUS_BASE_S + 0x00007800U)    /*!< WIFI base address */
#define HPDF_BASE_S             (APB2_BUS_BASE_S + 0x00006000U)    /*!< HPDF base address */
#define SYSCFG_BASE_S           (APB2_BUS_BASE_S + 0x00003800U)    /*!< SYSCFG base address */
#define EXTI_BASE_S             (APB2_BUS_BASE_S + 0x00003C00U)    /*!< EXTI base address */
#define SDIO_BASE_S             (APB2_BUS_BASE_S + 0x00002C00U)    /*!< SDIO base address */
#define ADC_BASE_S              (APB2_BUS_BASE_S + 0x00002000U)    /*!< ADC base address */

/* advanced high performance bus 1 memory map */
#define GPIO_BASE_S             (AHB1_BUS_BASE_S + 0x00000000U)    /*!< GPIO base address */
#define FMC_BASE_S              (AHB1_BUS_BASE_S + 0x00002000U)    /*!< FMC base address */
#define EFUSE_BASE_S            (AHB1_BUS_BASE_S + 0x00002800U)    /*!< EFUSE base address */
#define CRC_BASE_S              (AHB1_BUS_BASE_S + 0x00003000U)    /*!< CRC base address */
#define RCU_BASE_S              (AHB1_BUS_BASE_S + 0x00003800U)    /*!< RCU base address */
#define TSI_BASE_S              (AHB1_BUS_BASE_S + 0x00004000U)    /*!< TSI base address */
#define SQPI_REG_BASE_S         (AHB1_BUS_BASE_S + 0x00005400U)    /*!< SQPI base address */
#define QSPI_REG_BASE_S         (AHB1_BUS_BASE_S + 0x00005800U)    /*!< QSPI base address */
#define DMA_BASE_S              (AHB1_BUS_BASE_S + 0x00006000U)    /*!< DMA base address */
#define WIFI11N_BASE_S          (AHB1_BUS_BASE_S + 0x00010000U)    /*!< WIFI11N base address */
#define ICACHE_BASE_S           (AHB1_BUS_BASE_S + 0x00060000U)    /*!< ICACHE base address */
#define TZSPC_BASE_S            (AHB1_BUS_BASE_S + 0x00080000U)    /*!< TZSPC base address */
#define TZIAC_BASE_S            (AHB1_BUS_BASE_S + 0x00080400U)    /*!< TZIAC base address */
#define TZBMPC0_BASE_S          (AHB1_BUS_BASE_S + 0x00080800U)    /*!< TZBMPC0 base address */
#define TZBMPC1_BASE_S          (AHB1_BUS_BASE_S + 0x00080C00U)    /*!< TZBMPC1 base address */
#define TZBMPC2_BASE_S          (AHB1_BUS_BASE_S + 0x00090000U)    /*!< TZBMPC2 base address */
#define TZBMPC3_BASE_S          (AHB1_BUS_BASE_S + 0x00090400U)    /*!< TZBMPC3 base address */
#define USBFS_BASE_S            (AHB1_BUS_BASE_S + 0x08FE0000U)    /*!< USBFS base address */

/* advanced high performance bus 2 memory map */
#define DCI_BASE_S              (AHB2_BUS_BASE_S + 0x00050000U)    /*!< DCI base address */
#define CAU_BASE_S              (AHB2_BUS_BASE_S + 0x00060000U)    /*!< CAU base address */
#define HAU_BASE_S              (AHB2_BUS_BASE_S + 0x00060400U)    /*!< HAU base address */
#define TRNG_BASE_S             (AHB2_BUS_BASE_S + 0x00060800U)    /*!< TRNG base address */
#define PKCAU_BASE_S            (AHB2_BUS_BASE_S + 0x00061000U)    /*!< PKCAU base address */

/* debug memory map */
#define DBG_BASE                ((uint32_t)0xE0044000U)            /*!< DBG base address */ 

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/* main flash and SRAM memory map */
#define FLASH_BASE            FLASH_BASE_S                         /*!< main FLASH base address */
#define SRAM0_BASE            SRAM0_BASE_S                         /*!< SRAM0 base address */
#define SRAM1_BASE            SRAM1_BASE_S                         /*!< SRAM1 base address */
#define SRAM2_BASE            SRAM2_BASE_S                         /*!< SRAM2 base address */
#define SRAM3_BASE            SRAM3_BASE_S                         /*!< SRAM3 base address */

/* peripheral memory map */
#define APB1_BUS_BASE         APB1_BUS_BASE_S                      /*!< apb1 base address */
#define APB2_BUS_BASE         APB2_BUS_BASE_S                      /*!< apb2 base address */
#define AHB1_BUS_BASE         AHB1_BUS_BASE_S                      /*!< ahb1 base address */
#define AHB2_BUS_BASE         AHB2_BUS_BASE_S                      /*!< ahb2 base address */

/* advanced peripheral bus 1 memory map */
#define TIMER_BASE            TIMER_BASE_S                         /*!< TIMER base address */
#define RTC_BASE              RTC_BASE_S                           /*!< RTC base address */
#define WWDGT_BASE            WWDGT_BASE_S                         /*!< WWDGT base address */
#define FWDGT_BASE            FWDGT_BASE_S                         /*!< FWDGT base address */
#define I2S_ADD_BASE          I2S_ADD_BASE_S                       /*!< I2S1_add base address */
#define SPI_BASE              SPI_BASE_S                           /*!< SPI base address */
#define USART_BASE            USART_BASE_S                         /*!< USART base address */
#define I2C_BASE              I2C_BASE_S                           /*!< I2C base address */
#define PMU_BASE              PMU_BASE_S                           /*!< PMU base address */

/* advanced peripheral bus 2 memory map */
#define WIFI_RF_BASE          WIFI_RF_BASE_S                       /*!< WIFI base address */
#define HPDF_BASE             HPDF_BASE_S                          /*!< HPDF base address */
#define SYSCFG_BASE           SYSCFG_BASE_S                        /*!< SYSCFG base address */
#define EXTI_BASE             EXTI_BASE_S                          /*!< EXTI base address */
#define SDIO_BASE             SDIO_BASE_S                          /*!< SDIO base address */
#define ADC_BASE              ADC_BASE_S                           /*!< ADC base address */
/* advanced high performance bus 1 memory map */
#define GPIO_BASE             GPIO_BASE_S                          /*!< GPIO base address */
#define FMC_BASE              FMC_BASE_S                           /*!< FMC base address */
#define EFUSE_BASE            EFUSE_BASE_S                         /*!< EFUSE base address */
#define CRC_BASE              CRC_BASE_S                           /*!< CRC base address */
#define RCU_BASE              RCU_BASE_S                           /*!< RCU base address */
#define TSI_BASE              TSI_BASE_S                           /*!< TSI base address */
#define SQPI_REG_BASE         SQPI_REG_BASE_S                      /*!< SQPI base address */
#define QSPI_REG_BASE         QSPI_REG_BASE_S                      /*!< QSPI base address */
#define DMA_BASE              DMA_BASE_S                           /*!< DMA base address */
#define WIFI11N_BASE          WIFI11N_BASE_S                       /*!< WIFI11N base address */
#define ICACHE_BASE           ICACHE_BASE_S                        /*!< ICACHE base address */
#define TZSPC_BASE            TZSPC_BASE_S                         /*!< TZSPC base address */
#define TZIAC_BASE            TZIAC_BASE_S                         /*!< TZIAC base address */
#define TZBMPC0_BASE          TZBMPC0_BASE_S                       /*!< TZBMPC0 base address */
#define TZBMPC1_BASE          TZBMPC1_BASE_S                       /*!< TZBMPC1 base address */
#define TZBMPC2_BASE          TZBMPC2_BASE_S                       /*!< TZBMPC2 base address */
#define TZBMPC3_BASE          TZBMPC3_BASE_S                       /*!< TZBMPC3 base address */
#define USBFS_BASE            USBFS_BASE_S                         /*!< USBFS base address */

/* advanced high performance bus 2 memory map */
#define DCI_BASE              DCI_BASE_S                           /*!< DCI base address */
#define CAU_BASE              CAU_BASE_S                           /*!< CAU base address */
#define HAU_BASE              HAU_BASE_S                           /*!< HAU base address */
#define TRNG_BASE             TRNG_BASE_S                          /*!< TRNG base address */
#define PKCAU_BASE            PKCAU_BASE_S                         /*!< PKCAU base address */

#else
/* main flash and SRAM memory map */
#define FLASH_BASE            FLASH_BASE_NS                        /*!< main FLASH base address */
#define SRAM0_BASE            SRAM0_BASE_NS                        /*!< SRAM0 base address */
#define SRAM1_BASE            SRAM1_BASE_NS                        /*!< SRAM1 base address */
#define SRAM2_BASE            SRAM2_BASE_NS                        /*!< SRAM2 base address */
#define SRAM3_BASE            SRAM3_BASE_NS                        /*!< SRAM3 base address */

/* peripheral memory map */
#define APB1_BUS_BASE         APB1_BUS_BASE_NS                     /*!< apb1 base address */
#define APB2_BUS_BASE         APB2_BUS_BASE_NS                     /*!< apb2 base address */
#define AHB1_BUS_BASE         AHB1_BUS_BASE_NS                     /*!< ahb1 base address */
#define AHB2_BUS_BASE         AHB2_BUS_BASE_NS                     /*!< ahb2 base address */

/* advanced peripheral bus 1 memory map */
#define TIMER_BASE            TIMER_BASE_NS                        /*!< TIMER base address */
#define RTC_BASE              RTC_BASE_NS                          /*!< RTC base address */
#define WWDGT_BASE            WWDGT_BASE_NS                        /*!< WWDGT base address */
#define FWDGT_BASE            FWDGT_BASE_NS                        /*!< FWDGT base address */
#define I2S_ADD_BASE          I2S_ADD_BASE_NS                      /*!< I2S1_add base address */
#define SPI_BASE              SPI_BASE_NS                          /*!< SPI base address */
#define USART_BASE            USART_BASE_NS                        /*!< USART base address */
#define I2C_BASE              I2C_BASE_NS                          /*!< I2C base address */
#define PMU_BASE              PMU_BASE_NS                          /*!< PMU base address */

/* advanced peripheral bus 2 memory map */
#define WIFI_RF_BASE          WIFI_RF_BASE_NS                      /*!< WIFI base address */
#define HPDF_BASE             HPDF_BASE_NS                         /*!< HPDF base address */
#define SYSCFG_BASE           SYSCFG_BASE_NS                       /*!< SYSCFG base address */
#define EXTI_BASE             EXTI_BASE_NS                         /*!< EXTI base address */
#define SDIO_BASE             SDIO_BASE_NS                         /*!< SDIO base address */
#define ADC_BASE              ADC_BASE_NS                          /*!< ADC base address */

/* advanced high performance bus 1 memory map */
#define GPIO_BASE             GPIO_BASE_NS                         /*!< GPIO base address */
#define FMC_BASE              FMC_BASE_NS                          /*!< FMC base address */
#define EFUSE_BASE            EFUSE_BASE_NS                        /*!< EFUSE base address */
#define CRC_BASE              CRC_BASE_NS                          /*!< CRC base address */
#define RCU_BASE              RCU_BASE_NS                          /*!< RCU base address */
#define TSI_BASE              TSI_BASE_NS                          /*!< TSI base address */
#define SQPI_REG_BASE         SQPI_REG_BASE_NS                     /*!< SQPI base address */
#define QSPI_REG_BASE         QSPI_REG_BASE_NS                     /*!< QSPI base address */
#define DMA_BASE              DMA_BASE_NS                          /*!< DMA base address */
#define WIFI11N_BASE          WIFI11N_BASE_NS                      /*!< WIFI11N base address */
#define ICACHE_BASE           ICACHE_BASE_NS                       /*!< ICACHE base address */
#define TZSPC_BASE            TZSPC_BASE_NS                        /*!< TZSPC base address */
#define TZIAC_BASE            TZIAC_BASE_NS                        /*!< TZIAC base address */
#define TZBMPC0_BASE          TZBMPC0_BASE_NS                      /*!< TZBMPC0 base address */
#define TZBMPC1_BASE          TZBMPC1_BASE_NS                      /*!< TZBMPC1 base address */
#define TZBMPC2_BASE          TZBMPC2_BASE_NS                      /*!< TZBMPC2 base address */
#define TZBMPC3_BASE          TZBMPC3_BASE_NS                      /*!< TZBMPC3 base address */
#define USBFS_BASE            USBFS_BASE_NS                        /*!< USBFS base address */

/* advanced high performance bus 2 memory map */
#define DCI_BASE              DCI_BASE_NS                          /*!< DCI base address */
#define CAU_BASE              CAU_BASE_NS                          /*!< CAU base address */
#define HAU_BASE              HAU_BASE_NS                          /*!< HAU base address */
#define TRNG_BASE             TRNG_BASE_NS                         /*!< TRNG base address */
#define PKCAU_BASE            PKCAU_BASE_NS                        /*!< PKCAU base address */

#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */
/* define marco USE_STDPERIPH_DRIVER */
#if !defined  USE_STDPERIPH_DRIVER
#define USE_STDPERIPH_DRIVER
#endif /* no define USE_STDPERIPH_DRIVER*/
#ifdef USE_STDPERIPH_DRIVER
#include "gd32w51x_libopt.h"
#endif /* USE_STDPERIPH_DRIVER */

#ifdef __cplusplus
}
#endif
#endif /* GD32W51x_H */
